/*
SQLyog Ultimate v12.08 (64 bit)
MySQL - 6.0.11-alpha-community : Database - schoolsystem
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`schoolsystem` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `schoolsystem`;

/*Table structure for table `other_finance` */

DROP TABLE IF EXISTS `other_finance`;

CREATE TABLE `other_finance` (
  `of_id` int(100) NOT NULL AUTO_INCREMENT,
  `of_money` double(10,2) DEFAULT NULL,
  `of_state` int(101) DEFAULT NULL,
  `of_remark` text,
  `of_date` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`of_id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

/*Data for the table `other_finance` */

insert  into `other_finance`(`of_id`,`of_money`,`of_state`,`of_remark`,`of_date`) values (1,100.00,8,NULL,'2017-04-27 15:57:03'),(2,12.00,9,NULL,NULL),(3,55.00,NULL,NULL,NULL),(4,55.00,NULL,NULL,'2017-04-09 15:58:28');

/*Table structure for table `stu_shixun_info` */

DROP TABLE IF EXISTS `stu_shixun_info`;

CREATE TABLE `stu_shixun_info` (
  `id` int(100) NOT NULL AUTO_INCREMENT,
  `name` varchar(60) DEFAULT NULL,
  `district` varchar(60) DEFAULT NULL,
  `kaihuyinhang` varchar(100) DEFAULT NULL,
  `card_num` varchar(100) DEFAULT NULL,
  `zhuanye` varchar(24) DEFAULT NULL,
  `xueli` varchar(24) DEFAULT NULL,
  `id_card` varchar(50) DEFAULT NULL,
  `tel_self` varchar(50) DEFAULT NULL,
  `daikuanmingcheng` varchar(50) DEFAULT NULL,
  `begin_time` date DEFAULT NULL,
  `e_people_name` varchar(50) DEFAULT NULL,
  `e_people_tel` varchar(50) DEFAULT NULL,
  `r_people_name` varchar(50) DEFAULT NULL,
  `r_people_tel` varchar(50) DEFAULT NULL,
  `address` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=49 DEFAULT CHARSET=utf8;

/*Data for the table `stu_shixun_info` */

insert  into `stu_shixun_info`(`id`,`name`,`district`,`kaihuyinhang`,`card_num`,`zhuanye`,`xueli`,`id_card`,`tel_self`,`daikuanmingcheng`,`begin_time`,`e_people_name`,`e_people_tel`,`r_people_name`,`r_people_tel`,`address`) values (1,'李闯','河南','工商银行','6212261102017227904','null','高中','411381199705116330','15501388569','蜡笔分期','2017-09-15','李成水','15988853934','宋电辉','18736019504','欧马家具院内 A栋 118室'),(2,'张子通','石家庄','null','null','机械设计','大专','130129199210084213','15532145491','null','2017-05-03','13393217443','','自己住','null','朝阳'),(3,'宋电辉','河南郑州','null','null','null','null','130535199104152816','18736019504','蜡笔分期','2017-10-30','宋保海（父亲）','15532929785','李闯','15501388569','欧马家具院内118'),(4,'刘桂','山西','建设','null','null','初中','142621199805262912','18235704381','蜡笔','2017-11-30','18235738538','null','null','null','欧玛家具城115'),(5,'张艺','郑州','中国工商','622202 1702058089939','物流管理','大专','411123199105106011','15239540018','阳光','2017-06-15','王春勤','13938020112','赵明明','15660022952','欧玛家具院内204'),(6,'郭又筝','河南开封','中国建设银行','null','人力资源管理','大专','410211199703120015','13639695939','蜡笔分期','2017-09-15','常青梅','13938632842','孙亮','15890919609','祥福公寓'),(7,'杜凯','临汾','建设银行   ','6217000350005831121','NULL','NULL','142621199802202957','17635270857','蜡笔分期','2017-11-15','杜小会','18234772961','王宁伟','13233576297','欧马家具院内A栋115'),(8,'姚述龙','湖南长沙','mull','mull','文科','高中','431002199308171514','18175762600','蜡笔分期','2017-10-31','姚斌','18975728153','mull','mull','祥福公寓'),(9,'郭志衡','内蒙古呼和浩特市','建设银行','000000000000000','工程造价','大专','150430199505173622','15124772487','蜡笔分期','2017-11-30','郭井芳（爸爸）','15661256445','田仕远','13488572844','祥福公寓221'),(10,'董亚伦','河北省石家庄市','中国建设银行','6236680130004502312','null','初中','130182199901302912','13784300430','蜡笔分期','2017-11-15','13931100439','18712908385','张江林','15512169754','祥福公寓'),(11,'靳玉洋','北京嘉华','工商银行','6212260411001375517','null','高中','13082419900519601X','15231460589','蜡笔分期','2017-10-01','宋玉敏','18232405250','金成','18736821075','宿舍'),(12,'高旺旺','山西地区','中国建设银行','6217000320002576243','师范类-语文教育','大专','140224199608044217','15135239918','蜡笔分期','2017-11-15','高兴德','13753221424','么耀','13605723044','欧马家居A 104'),(13,'刘明贵','长沙','null','null','null','null','430522199806202418','13107017963','蜡笔分期','2017-12-15','刘协娇（母亲）','18350168936','ysl','18175762600','祥福公寓'),(14,'郭哲涵','河南郑州','中国邮政银行','6217994910036563668','物流管理','大专','411302199606241333','15137759779','惠分期','2017-12-12','张晚霞','15038781426','马腾','18537776083','欧马家具院内b栋 '),(15,'王册','河北省石家庄市','建设','6217000130031271033','null','中专','130128199710270913','18712908056','蜡笔分期','2017-11-15','王亚峰','13832308725','懂亚伦','13784300430','祥福公寓'),(16,'任锋','大连','中国建设银行','null','机电一体化','大专','370882199507064218','15064795917','蜡笔分期','2017-11-30','任东（父亲）','13953799785','李海涛','13500720316','欧马家居园内110'),(17,'段云明','河北石家庄','工商银行','6212260200111518128','null','null','130130199111090912','15230198067','蜡笔分期','2017-06-30','null','null','马姜峰','17734320568','祥福公寓后院110'),(18,'曹煜','石家庄','建设银行','null','null','null','130128199610191839','15901150464','蜡笔分期','2017-10-30','曹亚东','15830991663','石硕文','15210854133','祥福公寓117'),(19,'鲁力崇','河北石家庄','建设银行','6236 6815 4000 6919 562','null','初中','130133199603023336','17603225343','蜡笔分期','2017-11-30','鲁永军  父亲','13323045183','鲁亚飞','17603255013','祥福公寓 110'),(20,'李泽超','北京','工商','6212260200123481513','机械结构与维修','技校','110105199707104713','13552863981','分期乐','2017-12-20','宋秀金','15724725781','null','null','北京市朝阳区南竺园22号'),(21,'张志豪','河南郑州','中国银行','000000000000000000','null','null','410221199808253415','13027761065','蜡笔分期','2017-09-30','张海龙','18339231205','赵永杰','15890333847','欧马家具院'),(22,'鲁亚飞','河北石家庄','建设银行','null','null','初中','130133199508293354','17603255013','蜡笔分期','2017-11-30','刘密娟','13833478488','鲁力崇','17603225343','祥福公寓 110'),(23,'冯胜','北京嘉华','中国建设','6217000010068630881','null','null','320481199211204851','13052948069','百度钱包','2017-12-15','冯年报','13376290763','null','null','北京欧马家具院内216室'),(24,'门佳悦','北京市','招商','null','计算机网络技术','中专','110221199701235910','17319453527','蜡笔分期','2017-12-30','门德福','18911993122','null','null','北京市昌平区马池口镇白浮村589号'),(25,'赵永杰','郑州','中国银行','0000000000000000','null','null','410225199801103436','15890333847','蜡笔分期','2017-12-15','赵续明','15954961041','张志豪','13027761065','欧马家具院内'),(26,'丁胜超','河北石家庄','中国银行','null','null','null','130429199603044411','15028018201','蜡笔分期','2017-11-30','母亲','15097683441','杨丽兵','18813043832','祥福公寓131'),(27,'李敬','河北省石家庄市','工商','6212260406014491723','null','null','130528199409157219','15551777739','蜡笔分期','2017-12-15','余秀世','15033190942','李先生','17603218760','那啥村祥福家118号'),(28,'张江林','石家庄','中国建设银行','6236680130004412389','null','高中','510503199806062751','15512169754','蜡笔分期','2017-10-30','张文彬','18040397078','董亚伦','13784300430','祥福公寓'),(30,'赵林平','包头','中国建设银行','6217000420012761197','null','高中','62222319940413313','13919730140','蜡笔','2017-12-15','赵思礼','15379752260','null','null','欧码家具院内b栋219'),(32,'王旭亮','嘉禾','中国银行','null','null','null','130621199109051210','15194963587','蜡笔分期','2017-05-15','13403227757父亲','13403227757','null','null','欧码家具院内b栋118'),(33,'田云鹏','河北石家庄','工商','null','null','null','130133199609210618','18813040618','蜡笔分期','2017-11-15','田青彦','15833936226','阿仔','15232116211','祥福公寓'),(34,'苑魏中','河北省市石家庄','中国建设银行','6236680110002986592','null','null','130434199508173910','15028457616','蜡笔分期','2017-11-30','张金凤','13653107094','卢宇航','15188920447','祥福公寓'),(35,'赵义凡','河南','null','null','null','null','41018319980126481x','15736737455','蜡笔','2017-11-15','张俊娟','15238039457','阎亮','15503997360',''),(36,'付晓旺','河北石家庄','中国银行','null','null','null','130528199210087233','15194923741','蜡笔分期','0207-11-30','付永坚','15933724260','李敬','15551777739','祥福公寓'),(37,'高彪','呼和浩特','中国建设银行','6217000460003182730','矿山机电','中专','612726199509100337','15924409001','蜡笔分期','2017-11-30','赵爱梅    母亲','17792177876','马振国','13834493367','宿舍'),(38,'盛邦博','北京','工商','6212260200088888983','汽车检测与维修','中专','13068119940728123X','18513034019','百度钱包','2017-12-15','于艳梅','13833267306','冯盛','13052948069','北京欧马家具院内学生宿舍211'),(39,'赵军刚','石家庄','中国银行','000000000000000','null','null','13018519892922217','13522599103','null','2017-05-01','赵军胜','18610423410','杨超','17635836392','欧码家具 213'),(40,'马姜峰','河北石家庄','建设银行','6236680130004565509','汽车维修','null','130421199807142418','17734320568','蜡笔分期','2017-11-15','马守玉（爸爸）','13231066260','段云明','15230198067','祥福公寓110室'),(41,'方文鼎','河北','建设银行','6217000140022657694','汽车维修','中专','372928199710288312','17603216782','蜡笔分期','2017-10-30','方晓红 父亲','15098201623','申迎港','15932204586','祥福公寓102室'),(43,'杨丽兵','河北石家庄','建设银行','000000000000000','null','null','130426199408171117','18813043832','百度钱包','2017-12-15','姐','15032661123','李旭东','15188910884','祥福公寓'),(44,'李旭冬','河北石家庄','中国银行','000000000000000','null','null','130429199409156233','15188910884','蜡笔分期','2017-11-30','13730084690 父亲','13730084690','杨丽兵','18813043832','祥福公寓131室'),(45,'申营岗','河北省石家庄','建设银行','null','null','null','130434199503196910','15932204586','蚂蚁分期','2017-11-15','申会峰','13483010224','方文鼎','17603216782','祥福公寓'),(46,'马腾','河南 郑州','建设银行','null','汽车电子','大专','411302199512155119','18537776083','惠分期','2017-12-12','马香奇 （父亲）','13937725327','郭哲涵','15137759779','欧马家具院内，B栋102'),(47,'张艳丽','河北','中国工商银行','6212260402019306362','null','null','130125199305105544','15176824510','蜡笔分期','2017-11-30','张大马（父亲）','13722864573','付晓旺','15194923741','欧马家具内   B栋  205室'),(48,'贾立宾','河北','中国工商银行','6212260402021661986','null','null','130521199405102013','18730931485','蜡笔分期','2017-11-30','贾仁生','15930972240','苑魏中','15028457616','祥福公寓（前218室）');

/*Table structure for table `stu_tea` */

DROP TABLE IF EXISTS `stu_tea`;

CREATE TABLE `stu_tea` (
  `s_id` int(100) DEFAULT NULL,
  `t_id` int(100) DEFAULT NULL,
  KEY `s_id` (`s_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `stu_tea` */

insert  into `stu_tea`(`s_id`,`t_id`) values (1,1);

/*Table structure for table `student` */

DROP TABLE IF EXISTS `student`;

CREATE TABLE `student` (
  `s_id` int(100) NOT NULL AUTO_INCREMENT,
  `s_name` varchar(255) DEFAULT NULL,
  `s_sex` int(101) DEFAULT NULL,
  `s_xuefei` double(10,2) DEFAULT NULL,
  `s_startdate` date DEFAULT NULL,
  `s_enddate` date DEFAULT NULL,
  `s_state` int(101) DEFAULT NULL,
  PRIMARY KEY (`s_id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

/*Data for the table `student` */

insert  into `student`(`s_id`,`s_name`,`s_sex`,`s_xuefei`,`s_startdate`,`s_enddate`,`s_state`) values (1,'学生1',1,158800.00,'2017-04-10',NULL,5);

/*Table structure for table `sys_dictionary` */

DROP TABLE IF EXISTS `sys_dictionary`;

CREATE TABLE `sys_dictionary` (
  `d_id` int(101) unsigned NOT NULL AUTO_INCREMENT,
  `d_type` varchar(255) DEFAULT NULL,
  `d_value` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`d_id`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8;

/*Data for the table `sys_dictionary` */

insert  into `sys_dictionary`(`d_id`,`d_type`,`d_value`) values (1,'sex','男'),(2,'sex','女'),(3,'state','在职'),(4,'state','离职'),(5,'state','在校'),(6,'state','毕业'),(7,'state','开除'),(8,'finace-state','收入'),(9,'finace-state','支出');

/*Table structure for table `sys_finance` */

DROP TABLE IF EXISTS `sys_finance`;

CREATE TABLE `sys_finance` (
  `f_id` int(100) NOT NULL AUTO_INCREMENT,
  `f_close_account_date` date DEFAULT NULL,
  `f_normal_expanditure` double(10,2) DEFAULT NULL,
  `f_normal_income` double(10,2) DEFAULT NULL,
  `f_other_expanditure` double(10,2) DEFAULT NULL,
  `f_other_income` double(10,2) DEFAULT NULL,
  PRIMARY KEY (`f_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `sys_finance` */

/*Table structure for table `teacher` */

DROP TABLE IF EXISTS `teacher`;

CREATE TABLE `teacher` (
  `t_id` int(100) NOT NULL AUTO_INCREMENT,
  `t_name` varchar(255) NOT NULL,
  `t_salary` double(20,2) NOT NULL,
  `t_idcard` varchar(20) NOT NULL,
  `t_age` int(4) NOT NULL,
  `t_sex` int(101) DEFAULT NULL,
  `t_head_img` varchar(255) DEFAULT NULL,
  `t_startdate` date DEFAULT NULL,
  `t_enddate` date DEFAULT NULL,
  `t_state` int(101) DEFAULT '3',
  PRIMARY KEY (`t_id`)
) ENGINE=InnoDB AUTO_INCREMENT=31 DEFAULT CHARSET=utf8;

/*Data for the table `teacher` */

insert  into `teacher`(`t_id`,`t_name`,`t_salary`,`t_idcard`,`t_age`,`t_sex`,`t_head_img`,`t_startdate`,`t_enddate`,`t_state`) values (1,'唯一',8888.00,'19999',25,1,'a.jpg','2008-01-28','2011-08-16',4),(2,'王五',58.20,'155779999999999',14,1,'/888/oo/pp.jpg','2016-11-27',NULL,3),(3,'王五',58.20,'1478-----9',25,1,'/888/oo/pp.jpg',NULL,'1970-01-01',3),(4,'王五',58.20,'1478-----9',25,1,'/888/oo/pp.jpg',NULL,'1970-01-01',3),(6,'王五',58.20,'1478-----9',25,2,'/888/oo/pp.jpg','2017-05-09',NULL,3),(14,'777',88.00,'88',88,1,'88','2017-05-12',NULL,3),(15,'诶我去222',2324.00,'ewqeqw',3,1,'213','2017-05-01',NULL,3),(16,'二宝',5.00,'44',444,1,'QQ浏览器截屏未命名.png','2017-05-02',NULL,3),(18,'二宝宝',2222.00,'2222',222,2,'QQ浏览器截屏未命名.png','2017-05-03',NULL,3),(19,'nan',4444.00,'55555',67,2,NULL,NULL,NULL,3),(21,'7777',888.00,'88888',88,1,'头像.bmp',NULL,NULL,3),(22,'天下',222.00,'2222',444,2,'头像.bmp','2017-05-01',NULL,3),(23,'天下',222.00,'2222',444,1,'头像.bmp','2017-05-01',NULL,3),(24,'恶趣味',798.00,'789',789879,1,'头像.bmp','2017-05-03',NULL,3),(25,'12',312.00,'12',312,2,'头像.bmp','2017-05-02',NULL,3),(26,'87',213.00,'231',123,1,'头像.bmp','2017-05-08',NULL,3),(27,'8978',34.00,'324',23423,2,'xing.bmp','2017-05-17',NULL,3),(28,'989',78978.00,'789',78978,1,'xing.bmp','2017-05-03','2017-05-03',4),(30,'8888',8888.00,'88888',88888,1,'头像.bmp','2017-05-08',NULL,3);

/*Table structure for table `users` */

DROP TABLE IF EXISTS `users`;

CREATE TABLE `users` (
  `id` int(100) unsigned NOT NULL AUTO_INCREMENT,
  `account` varchar(255) NOT NULL,
  `password` varchar(100) NOT NULL,
  `phone` varchar(20) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=20 DEFAULT CHARSET=utf8;

/*Data for the table `users` */

insert  into `users`(`id`,`account`,`password`,`phone`) values (1,'admin','admin',NULL),(2,'李四','789','18888888888'),(3,'aaa','aaa',NULL),(4,'aaa','aaa',NULL),(6,'李四66','78966','18899999666'),(7,'李四','789','18888888888'),(8,'李四','789','18888888888'),(10,'李四','789','18888888888'),(11,'李wu','789','18888888888'),(12,'李四','789','18888888888'),(13,'李wu','789','18888888888'),(14,'李四','789','18888888888'),(15,'李wu','789','18888888888'),(16,'李四','789','18888888888'),(17,'李wu','789','18888888888'),(18,'李四','789','18888888888'),(19,'李wu','789','18888888888');

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
